esp8266/Arduino/libraries/ESP8266WebServer/src/ESP8266WebServer-impl.h
    DBGWS("New client\n");

    _currentStatus = HC_WAIT_READ;
    _statusChange = millis();
  }

  bool keepCurrentClient = false;
  bool callYield = false;

#ifdef DEBUG_ESP_HTTP_SERVER

  struct compare_s
  {
    uint8_t connected;
    int available;
    HTTPClientStatus status;
    bool operator != (const compare_s& o)
    {
      return    o.connected != connected
             || o.available != available
             || o.status != status;
    }
  };
  static compare_s last { false, 0, HC_NONE };
  compare_s now { _currentClient.connected(), _currentClient.available(), _currentStatus };

  if (last != now)
  {
    DBGWS("http-server loop: conn=%d avail=%d status=%s\n",
      _currentClient.connected(), _currentClient.available(),
      _currentStatus==HC_NONE?"none":
      _currentStatus==HC_WAIT_READ?"wait-read":
      _currentStatus==HC_WAIT_CLOSE?"wait-close":
      "??");
    last = now;
  }

#endif // DEBUG_ESP_HTTP_SERVER

  if (_currentClient.connected() || _currentClient.available()) {
    if (_currentClient.available() && _keepAlive) {
      _currentStatus = HC_WAIT_READ;
    }

    switch (_currentStatus) {
    case HC_NONE:
      // No-op to avoid C++ compiler warning
      break;
    case HC_WAIT_READ:
      // Wait for data from client to become available
      if (_currentClient.available()) {
        switch (_parseRequest(_currentClient))
        {
        case CLIENT_REQUEST_CAN_CONTINUE:
          _currentClient.setTimeout(HTTP_MAX_SEND_WAIT);
          _contentLength = CONTENT_LENGTH_NOT_SET;
          _handleRequest();
          /* fallthrough */
        case CLIENT_REQUEST_IS_HANDLED:
          if (_currentClient.connected() || _currentClient.available()) {
            _currentStatus = HC_WAIT_CLOSE;
            _statusChange = millis();
            keepCurrentClient = true;
          }
          else
            DBGWS("webserver: peer has closed after served\n");
          break;
        case CLIENT_MUST_STOP:
          DBGWS("Close client\n");
          _currentClient.stop();
          break;
        case CLIENT_IS_GIVEN:
          // client must not be stopped but must not be handled here anymore
          // (example: tcp connection given to websocket)
          DBGWS("Give client\n");
          break;
        } // switch _parseRequest()
      } else {
        // !_currentClient.available(): waiting for more data
        unsigned long timeSinceChange = millis() - _statusChange;
        // Use faster connection drop timeout if any other client has data
        // or the buffer of pending clients is full
        if ((_server.hasClientData() || _server.hasMaxPendingClients())
          && timeSinceChange > HTTP_MAX_DATA_AVAILABLE_WAIT)
            DBGWS("webserver: closing since there's another connection to read from\n");
        else {
          if (timeSinceChange > HTTP_MAX_DATA_WAIT)
            DBGWS("webserver: closing after read timeout\n");
          else
            keepCurrentClient = true;
        }
        callYield = true;
      }
      break;
    case HC_WAIT_CLOSE:
      // Wait for client to close the connection
      if (!_server.hasClient() && (millis() - _statusChange <= HTTP_MAX_CLOSE_WAIT)) {
        keepCurrentClient = true;
        callYield = true;
        if (_currentClient.available())
            // continue serving current client
            _currentStatus = HC_WAIT_READ;
      }
      break;
    } // switch _currentStatus
  }

  if (!keepCurrentClient) {
    DBGWS("Drop client\n");
    _currentClient = ClientType();
    _currentStatus = HC_NONE;
    _currentUpload.reset();
  }

  if (callYield) {
    yield();
  }
}

template <typename ServerType>
void ESP8266WebServerTemplate<ServerType>::close() {
  _server.close();
  _currentStatus = HC_NONE;
  if(!_headerKeysCount)
    collectHeaders();
}

template <typename ServerType>
void ESP8266WebServerTemplate<ServerType>::stop() {
  close();
}

template <typename ServerType>
void ESP8266WebServerTemplate<ServerType>::_storeHeader(std::pair<String, String>&& nameValue, bool first) {
    if (first)
        _userHeaders.emplace_front(std::move(nameValue));
    else
        _userHeaders.emplace_back(std::move(nameValue));
}

template <typename ServerType>
void ESP8266WebServerTemplate<ServerType>::setContentLength(const size_t contentLength) {
    _contentLength = contentLength;
}

template <typename ServerType>
bool ESP8266WebServerTemplate<ServerType>::_streamIt (Stream& s) {
    int len = s.streamRemaining();
    int sent = s.sendAll(&_currentClient);
    if (sent == len)
        return true;
    DBGWS("HTTPServer: error: sent %zd on %u bytes\n", sent, len);
    return false;
}

template <typename ServerType>
template <typename K, typename V>
bool ESP8266WebServerTemplate<ServerType>::_streamHeader (K name, V value)
{
    return _streamIt(name) && _streamItC(F(": ")) && _streamIt(value) && _streamItC(F("\r\n"));
}

template <typename ServerType>
bool ESP8266WebServerTemplate<ServerType>::_sendHeader(int code, const char* content_type, size_t contentLength) {
    if (   !_streamItC(F("HTTP/1."))
        || !_streamIt(String(_currentVersion))
        || !_streamItC(F(" "))
        || !_streamIt(String(code))
        || !_streamItC(F(" "))
        || !_streamIt(responseCodeToString(code))
        || !_streamItC(F("\r\n")))
    {
        return false;
    }

    using namespace mime;
    if (!content_type)
        content_type = mimeTable[html].mimeType;
    if (!_streamHeader(F("Content-Type"), content_type))
        return false;

    if (_contentLength == CONTENT_LENGTH_NOT_SET) {
        if (!_streamHeader(Content_Length, String(contentLength)))
            return false;
    } else if (_contentLength != CONTENT_LENGTH_UNKNOWN) {
        if (!_streamHeader(Content_Length, String(_contentLength)))
            return false;
    } else if (_contentLength == CONTENT_LENGTH_UNKNOWN && _currentVersion){ //HTTP/1.1 or above client
        //let's do chunked
        _chunked = true;
        if (!_streamHeader(F("Accept-Ranges"), F("none")) || !_streamHeader(F("Transfer-Encoding"), F("chunked")))
            return false;
    }

    if (_corsEnabled) {
        if (!_streamHeader(F("Access-Control-Allow-Origin"), F("*")))
            return false;
    }

    if (_keepAlive && _server.hasClient()) {
        // Disable keep alive if another client is waiting.
        _keepAlive = false;
    }
    if (!_streamHeader(F("Connection"), String(_keepAlive ? F("keep-alive") : F("close")))) {
        return false;
    }
    if (_keepAlive) {
        if (!_streamHeader(F("Keep-Alive"), String(F("timeout=")) + HTTP_MAX_CLOSE_WAIT))
            return false;
    }

    for (const auto& kv: _userHeaders)
        if (!_streamHeader(kv.first, kv.second))
            return false;
    _userHeaders.clear();

    if (!_streamItC(F("\r\n")))
        return false;

